app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 16]]
---
<h4>Comments</h4>
<% @post.comments.each do |comment| %>