app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:post_id])
    @comments = @post.comments.all
---
SELECT "comments".* FROM "comments"

  def show
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def new
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def edit
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "content", "created_at", "updated_at", "post_id", "email") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Hey"], ["content", "oaidkwa"], ["created_at", 2017-02-09 13:45:24 UTC], ["updated_at", 2017-02-09 13:45:24 UTC], ["post_id", 16], ["email", "howdo"]]

  def update
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    if @comment.update(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]
UPDATE "comments" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["name", "Ash Rhazaly"], ["email", "ashleighrhazaly@gmail.com"], ["updated_at", 2017-02-09 13:05:09 UTC], ["id", 38]]

  def destroy
    post = Post.find(params[:post_id])
    @comment = post.comments.find(params[:id])
    @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 16], ["id", 16], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]