app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 16], ["id", 16], ["LIMIT", 1]]
---
  def edit
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])