app/controllers/posts_controller.rb

  def index
    @posts = Post.page(params[:page]).per(2).order('created_at DESC')
---
SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello"], ["content", "Hi"], ["created_at", 2017-02-07 07:03:53 UTC], ["updated_at", 2017-02-07 07:03:53 UTC]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "blog_author" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Hey there whats up"], ["blog_author", "AshAsh"], ["updated_at", 2017-02-08 08:08:27 UTC], ["id", 15]]